Config/InformationRegisters/МедицинскоеОборудованиеФРМО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>МедицинскоеОборудованиеФРМО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипОборудования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыМедицинскогоОборудованияФРМО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазделИзделия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыНоменклатурнойКлассификацииМедицинскихИзделийПоВидам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипИзделия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурнаяКлассификацияМедицинскихИзделийПоВидам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяЗамена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Общее</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерУдостоверения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтранаПроизводства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнойАдрес</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИногоАдреса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестонахождениеФРМО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестонахождениеФРМО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнвентарныйНомерКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыпуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВводаВЭксплуатацию</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыводаИзЭксплуатации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаВыводаИзЭксплуатации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭксплуатацияЗавершена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокСлужбы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИнвентарныйНомер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнвентарныеНомераОС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/СобытияОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СобытияОС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПричинаСписания</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПричинаСписания</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазваниеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИнвНомер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнвентарныеНомераОС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСобытийОС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/РасчетАмортизацииОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РасчетАмортизацииОС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СрокПолезногоИспользования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокИспользованияДляВычисленияАмортизации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьДляВычисленияАмортизации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентУскорения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПараметрВыработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПараметрыВыработкиОС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредполагаемыйОбъемВыработки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Enums/ВидыСобытийОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыСобытийОС</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПринятиеКУчету</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводВЭксплуатацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутреннееПеремещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КапитальныйРемонт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переоценка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реконструкция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочие состояния (пользовательские)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СдачаВАренду</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВБезвозмездноеПользование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратИзАренды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратИзБезвозмездногоПользования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Консервация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расконсервация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВЛичноеПользование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратИзЛичногоПользования</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/InformationRegisters/МедицинскоеОборудованиеФРМО/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

// Обновление на версию 2.0.110
//
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Реестр.Организация КАК Организация,
	|	Реестр.ОсновноеСредство КАК ОсновноеСредство,
	|	Реестр.ИнвентарныйНомер КАК ИнвентарныйНомер
	|ИЗ
	|	РегистрСведений.МедицинскоеОборудованиеФРМО КАК Реестр
	|ГДЕ
	|	(ВЫРАЗИТЬ(Реестр.Наименование КАК СТРОКА(1))) = """"";
	
	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	ДополнительныеПараметры.ЭтоНезависимыйРегистрСведений = Истина;
	ДополнительныеПараметры.ПолноеИмяРегистра = ПолноеИмяРегистра();
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Запрос.Выполнить().Выгрузить(), ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	Параметры.ОбработкаЗавершена = Ложь;
	
	ПолноеИмяРегистра = ПолноеИмяРегистра();
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	РезультатВыборки = ОбновлениеИнформационнойБазы.СоздатьВременнуюТаблицуИзмеренийНезависимогоРегистраСведенийДляОбработки(
		Параметры.Очередь, ПолноеИмяРегистра, МенеджерВременныхТаблиц);
	
	Если Не РезультатВыборки.ЕстьДанныеДляОбработки Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	ИначеЕсли Не РезультатВыборки.ЕстьЗаписиВоВременнойТаблице Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ПустойНомер", ИнтеграцияФРМОКлиентСервер.ПустойНомерПоУмолчанию());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СобытияОССрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	СобытияОССрезПоследних.ИнвНомер КАК ИнвентарныйНомер,
	|	СобытияОССрезПоследних.Событие КАК Событие,
	|	НАЧАЛОПЕРИОДА(СобытияОССрезПоследних.ДатаСобытия, ДЕНЬ) КАК ДатаСобытия,
	|	СобытияОССрезПоследних.ПричинаСписания КАК ПричинаСписания
	|ПОМЕСТИТЬ ВТСобытия
	|ИЗ
	|	РегистрСведений.СобытияОС.СрезПоследних(
	|			,
	|			(Организация, ОсновноеСредство, ИнвНомер) В
	|				(ВЫБРАТЬ
	|					Реестр.Организация,
	|					Реестр.ОсновноеСредство,
	|					Реестр.ИнвентарныйНомер
	|				ИЗ
	|					ВТ_Реестр КАК Реестр)) КАК СобытияОССрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетАмортизацииОССрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	ОКР(РасчетАмортизацииОССрезПоследних.СрокПолезногоИспользования / 12) КАК СрокСлужбы
	|ПОМЕСТИТЬ ВТСПИ
	|ИЗ
	|	РегистрСведений.РасчетАмортизацииОС.СрезПоследних(
	|			,
	|			(Организация, ОсновноеСредство) В
	|				(ВЫБРАТЬ
	|					Реестр.Организация,
	|					Реестр.ОсновноеСредство
	|				ИЗ
	|					ВТ_Реестр КАК Реестр)) КАК РасчетАмортизацииОССрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Реестр.Организация КАК Организация,
	|	Реестр.ОсновноеСредство КАК ОсновноеСредство,
	|	Реестр.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ВЫБОР
	|		КОГДА Реестр.ОсновноеСредство.НаименованиеПолное = """"
	|			ТОГДА Реестр.ОсновноеСредство.Наименование
	|		ИНАЧЕ Реестр.ОсновноеСредство.НаименованиеПолное
	|	КОНЕЦ КАК Наименование,
	|	ВЫБОР
	|		КОГДА Реестр.ИнвентарныйНомер = ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)
	|			ТОГДА &ПустойНомер
	|		ИНАЧЕ СОКРП(Реестр.ИнвентарныйНомер.Код)
	|	КОНЕЦ КАК ИнвентарныйНомерКод,
	|	ВЫБОР
	|		КОГДА Реестр.ИнвентарныйНомер = ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)
	|			ТОГДА &ПустойНомер
	|		ИНАЧЕ Реестр.ИнвентарныйНомер.ЗаводскойНомер
	|	КОНЕЦ КАК СерийныйНомер,
	|	Реестр.ИнвентарныйНомер.ДатаВыпуска КАК ДатаВыпуска,
	|	ОсновныеСредстваКонтактнаяИнформация.Значение КАК Адрес,
	|	ВТВвод.ДатаСобытия КАК ДатаВводаВЭксплуатацию,
	|	ВТВывод.ДатаСобытия КАК ДатаВыводаИзЭксплуатации,
	|	ВТВывод.ПричинаСписания КАК ПричинаВыводаИзЭксплуатации,
	|	ВТСПИ.СрокСлужбы КАК СрокСлужбы
	|ИЗ
	|	ВТ_Реестр КАК Реестр
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства.КонтактнаяИнформация КАК ОсновныеСредстваКонтактнаяИнформация
	|		ПО Реестр.ОсновноеСредство = ОсновныеСредстваКонтактнаяИнформация.Ссылка
	|			И (ОсновныеСредстваКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресМестонахожденияОбъектаОС))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСПИ КАК ВТСПИ
	|		ПО Реестр.ОсновноеСредство = ВТСПИ.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСобытия КАК ВТВвод
	|		ПО Реестр.ОсновноеСредство = ВТВвод.ОсновноеСредство
	|			И Реестр.ИнвентарныйНомер = ВТВвод.ИнвентарныйНомер
	|			И (ВТВвод.Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ВводВЭксплуатацию))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСобытия КАК ВТВывод
	|		ПО Реестр.ОсновноеСредство = ВТВывод.ОсновноеСредство
	|			И Реестр.ИнвентарныйНомер = ВТВывод.ИнвентарныйНомер
	|			И (ВТВывод.Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Списание))";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТ_Реестр", РезультатВыборки.ИмяВременнойТаблицы);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.ДатаВыводаИзЭксплуатации) Тогда
			Если ЗначениеЗаполнено(Выборка.ПричинаВыводаИзЭксплуатации) Тогда
				ПричинаВыводаИзЭксплуатации = Выборка.ПричинаВыводаИзЭксплуатации;
			Иначе
				ПричинаВыводаИзЭксплуатации = "Неизвестно";
			КонецЕсли;
		Иначе
			ПричинаВыводаИзЭксплуатации = "";
		КонецЕсли;
		
		НаборЗаписей = РегистрыСведений.МедицинскоеОборудованиеФРМО.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Организация.Установить(Выборка.Организация);
		НаборЗаписей.Отбор.ОсновноеСредство.Установить(Выборка.ОсновноеСредство);
		НаборЗаписей.Отбор.ИнвентарныйНомер.Установить(Выборка.ИнвентарныйНомер);
		
		НаборЗаписей.Прочитать(); 
		
		Для Каждого Запись Из НаборЗаписей Цикл
			
			Если Запись.ИнойАдрес Тогда
				СвойстваАдреса = ИнтеграцияФРМО.АдресБГУвФРМО(Выборка.Адрес);
				Адрес = СвойстваАдреса.Значение;
			Иначе
				Адрес = "";
			КонецЕсли;
			
			Запись.Наименование					= Выборка.Наименование;
			Запись.ИнвентарныйНомерКод			= Выборка.ИнвентарныйНомерКод;
			Запись.СерийныйНомер				= Выборка.СерийныйНомер;
			Запись.СрокСлужбы					= Выборка.СрокСлужбы;
			Запись.ДатаВыпуска					= Выборка.ДатаВыпуска;
			Запись.ДатаВводаВЭксплуатацию		= Выборка.ДатаВводаВЭксплуатацию;
			Запись.ДатаВыводаИзЭксплуатации		= Выборка.ДатаВыводаИзЭксплуатации;
			Запись.ПричинаВыводаИзЭксплуатации	= ПричинаВыводаИзЭксплуатации;
			Запись.ЭксплуатацияЗавершена		= ЗначениеЗаполнено(Выборка.ДатаВыводаИзЭксплуатации);
			Запись.Адрес						= Адрес;
			Запись.Количество					= 1;
			
		КонецЦикла;
		
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
		
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяРегистра);
	
КонецПроцедуры

Функция ПолноеИмяРегистра()
	
	Возврат Метаданные.РегистрыСведений.МедицинскоеОборудованиеФРМО.ПолноеИмя();
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
